<?php

namespace Database\Seeders;

use App\Models\ServiceCategory;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServiceCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $categories = [
            'خدمات الدائرة الفنية' => 'تقدم الدائرة الفنية خدمات تتعلق بالتخطيط الهندسي والتنفيذ الفني للمشاريع المدنية والبنية التحتية، بما في ذلك الطرق والجسور والمباني. تتولى هذه الخدمة تنفيذ المشاريع الهندسية بدقة وفقًا للمعايير الفنية والتشريعات المعمول بها.',
            'خدمات المياه والصرف الصحي' => 'توفر خدمات المياه والصرف الصحي توريد المياه النظيفة والتخلص الآمن من مياه الصرف الصحي. تشمل هذه الخدمة تشغيل وصيانة شبكات المياه والصرف الصحي، وإدارة منظومات التحلية والتنقية، وتوفير خدمات الصرف الصحي للمجتمع.',
            'خدمات الحرف والصناعات' => 'تتضمن خدمات الحرف والصناعات دعم الصناعات المحلية وتعزيز الحرف التقليدية والحرف اليدوية في المنطقة. يشمل ذلك دعم وتشجيع المشاريع الصغيرة والمتوسطة، وتقديم الدعم التقني والمالي للحرفيين وأصحاب الأعمال الصغيرة، وتنظيم المعارض والفعاليات الترويجية للحرف التقليدية والصناعات المحلية.',
        ];


        foreach ($categories as $category => $description) {
            ServiceCategory::create([
                'name' => $category,
                'description' => $description
            ]);
        }
    }
}
